brew "bat"
brew "black"
brew "carapace"
brew "cmake"
brew "difftastic"
brew "eza"
brew "fd"
brew "fzf"
brew "go"
brew "jj"
brew "jq"
brew "node"
brew "kind"
brew "kubecolor"
brew "kubectx"
brew "mergiraf"
brew "neovim"
brew "nushell"
brew "poppler"
brew "ripgrep"
brew "starship"
brew "television"
brew "wget"
brew "yq"
brew "zoxide"
brew "rustup"
brew "btop"

on_macos do
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace"
cask "maccy"
cask "meetingbar"
cask "font-jetbrains-mono"
cask "obs"
cask "spotify"
cask "visual-studio-code"
cask "zed"
cask "firefox"
cask "wezterm"
cask "obsidian"
end


go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
